---
kind: type
id: T:Autodesk.Revit.DB.Events.FileImportingEventArgs
source: html/be397e59-7332-cb8f-426d-ebe7f420e0c9.htm
---
# Autodesk.Revit.DB.Events.FileImportingEventArgs

The event arguments used by the FileImporting event.

## Syntax (C#)
```csharp
public class FileImportingEventArgs : RevitAPIPreDocEventArgs
```